import acc1 from "../../assets/images/acc1.jpg";
import acc2 from "../../assets/images/acc2.jpg";
import acc3 from "../../assets/images/acc3.jpg";
import acc4 from "../../assets/images/acc4.jpg";
import menu1 from "../../assets/images/menu1.jpg";
import menu2 from "../../assets/images/menu2.jpg";
import menu3 from "../../assets/images/menu3.jpg";
import menu4 from "../../assets/images/menu4.jpg";

export const menuData = [
  {
    id: 1,
    name: "Лонгборды",
    role: "Классика",
    description:
      "Легенда среди серф-досок. Благодаря своей длине и плавности хода лонгборды идеально подходят для размеренного катания и красивых, вытянутых поворотов. Это отличный выбор для новичков — легко ловить волну, устойчиво стоять, безопасно учиться. Но и опытные серферы ценят их за возможность стильно скользить по гребню волны. Лонгборд — это про эстетику, свободу и ритм океана. Если хочешь почувствовать дух старой школы, начни с него.",
    image: acc1,
    pic: menu1,
  },
  {
    id: 2,
    name: "Шортборды",
    role: "Скорость и маневры",
    description:
      "Выбор для тех, кто хочет кататься быстро и технично. Шортборд — это резкие повороты, прыжки, манёвры и адреналин в чистом виде. Они менее стабильны, чем длинные доски, но в опытных руках превращаются в настоящее оружие. Эти доски раскрываются на более крутых и быстрых волнах, требуя от серфера ловкости и точности. Отличный вариант, если ты уже уверенно катаешься и хочешь развиваться дальше. Настоящее веселье начинается здесь.",
    image: acc2,
    pic: menu2,
  },
  {
    id: 3,
    name: "Фанборды",
    role: "Прогресс и универсальность",
    description:
      "Идеальный мост между длинными и короткими досками. Фанборды берут лучшее от обоих миров: они достаточно стабильны, чтобы легко разгребаться на волны, но при этом позволяют делать классные, уверенные повороты. Отличный выбор для тех, кто уже перерос первые шаги на лонгборде, хочет кататься на волнах самого разного размера и активно развивать свои навыки без лишнего стресса.",
    image: acc3,
    pic: menu3,
  },
  {
    id: 4,
    name: "Фишборды", // Добавлен четвертый элемент под слайдер
    role: "Драйв на малых волнах",
    description:
      "Компактные доски со взрывным характером. Благодаря широкому носу и раздвоенному хвосту, фишборд буквально летит по воде, отлично генерируя скорость даже на слабых и пологих волнах. Он дарит невероятное ощущение свободы и плавности в поворотах. Идеальное решение для летнего катания, когда океан не радует большими прогнозами, но хочется взять от сессии максимум фана.",
    image: acc4,
    pic: menu4,
  },
];
