import board1 from "../../assets/images/board1.webp";
import board2 from "../../assets/images/board2.webp";
import board3 from "../../assets/images/board3.webp";
import board4 from "../../assets/images/board4.webp";

export const boards = [
  {
    id: 1,
    title: "Лонгборд 2.0",
    description:
      "Устойчивая доска для новичков. На ней легко лежать, сидеть, грести и ловить небольшие пологие волны. Отличный выбор для спокойного катания и первых шагов в сёрфинге.",
    length: "от 2,7 метров",
    width: "от 55 сантиметров",
    thickness: "7.5 см",
    lifespan: "5 лет",
    weight: "7–8 кг",
    price: 700,
    image: board1,
  },
  {
    id: 2,
    title: "Шортборд",
    description:
      "Быстрая и манёвренная доска для опытных серферов. Подходит для резких поворотов, разворотов, прыжков и катания в трубах. Выбор тех, кто хочет полностью раскрыть свой потенциал на волне.",
    length: "от 1,8 метров",
    width: "от 48 сантиметров",
    thickness: "5.5 см",
    lifespan: "3 года",
    weight: "3–4 кг",
    price: 1200,
    image: board2,
  },
  {
    id: 3,
    title: "Фанборд",
    description:
      "Универсальная доска, которая сочетает устойчивость и хорошую манёвренность. Подходит тем, кто уже освоил основы сёрфинга и хочет уверенно прогрессировать на волнах разного размера.",
    length: "от 2,2 метра",
    width: "от 53 сантиметров",
    thickness: "7 см",
    lifespan: "5 лет",
    weight: "5–6 кг",
    price: 900,
    image: board3,
  },
  {
    id: 4,
    title: "Фишборд",
    description:
      "Компактная доска с широким носом и характерным раздвоенным хвостом. Хорошо подходит для небольших или слабых волн, позволяет быстро набирать скорость и получать удовольствие от свободного катания.",
    length: "от 1,7 метра",
    width: "от 54 сантиметров",
    thickness: "6.3 см",
    lifespan: "4 года",
    weight: "4–5 кг",
    price: 1050,
    image: board4,
  },
];
